repository/resources/perf-test/results/siddhiesb_results_round1.txt
Warm-up ...
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		8.718088 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		11,470.40 [#/sec] (mean)
Time per request:		8.718 [ms] (mean)
Time per request:		0.087 [ms] (mean, across all concurrent requests)
Transfer rate:			22,390.23 [Kbytes/sec] received
				22,390.23 kb/s sent
				44,780.46 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.541224 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,486.56 [#/sec] (mean)
Time per request:		10.541 [ms] (mean)
Time per request:		0.105 [ms] (mean, across all concurrent requests)
Transfer rate:			18,517.77 [Kbytes/sec] received
				18,517.77 kb/s sent
				37,035.55 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		18.142993 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,511.77 [#/sec] (mean)
Time per request:		18.143 [ms] (mean)
Time per request:		0.181 [ms] (mean, across all concurrent requests)
Transfer rate:			10,758.97 [Kbytes/sec] received
				10,758.97 kb/s sent
				21,517.95 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.274395 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,869.66 [#/sec] (mean)
Time per request:		11.274 [ms] (mean)
Time per request:		0.113 [ms] (mean, across all concurrent requests)
Transfer rate:			17,313.57 [Kbytes/sec] received
				17,313.57 kb/s sent
				34,627.13 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.431556 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,586.30 [#/sec] (mean)
Time per request:		10.432 [ms] (mean)
Time per request:		0.104 [ms] (mean, across all concurrent requests)
Transfer rate:			18,712.45 [Kbytes/sec] received
				18,712.45 kb/s sent
				37,424.91 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.440196 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,741.11 [#/sec] (mean)
Time per request:		11.440 [ms] (mean)
Time per request:		0.114 [ms] (mean, across all concurrent requests)
Transfer rate:			17,062.65 [Kbytes/sec] received
				17,062.65 kb/s sent
				34,125.29 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.040995 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,304.96 [#/sec] (mean)
Time per request:		12.041 [ms] (mean)
Time per request:		0.120 [ms] (mean, across all concurrent requests)
Transfer rate:			16,211.28 [Kbytes/sec] received
				16,211.28 kb/s sent
				32,422.57 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.914554 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,743.20 [#/sec] (mean)
Time per request:		12.915 [ms] (mean)
Time per request:		0.129 [ms] (mean, across all concurrent requests)
Transfer rate:			15,114.73 [Kbytes/sec] received
				15,114.73 kb/s sent
				30,229.46 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.961665 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,715.06 [#/sec] (mean)
Time per request:		12.962 [ms] (mean)
Time per request:		0.130 [ms] (mean, across all concurrent requests)
Transfer rate:			15,059.79 [Kbytes/sec] received
				15,059.79 kb/s sent
				30,119.59 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.402768 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99965
Total transferred:		390396096 bytes
Requests per second:		7,461.07 [#/sec] (mean)
Time per request:		13.403 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,564.01 [Kbytes/sec] received
				14,564.01 kb/s sent
				29,128.01 kb/s total
Warmup Completed!
Warm-up ...
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.285634 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,722.30 [#/sec] (mean)
Time per request:		10.286 [ms] (mean)
Time per request:		0.103 [ms] (mean, across all concurrent requests)
Transfer rate:			18,977.92 [Kbytes/sec] received
				18,977.92 kb/s sent
				37,955.85 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.686237 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,357.83 [#/sec] (mean)
Time per request:		10.686 [ms] (mean)
Time per request:		0.107 [ms] (mean, across all concurrent requests)
Transfer rate:			18,266.49 [Kbytes/sec] received
				18,266.49 kb/s sent
				36,532.97 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		19.993778 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,001.56 [#/sec] (mean)
Time per request:		19.994 [ms] (mean)
Time per request:		0.200 [ms] (mean, across all concurrent requests)
Transfer rate:			9,763.04 [Kbytes/sec] received
				9,763.04 kb/s sent
				19,526.07 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.146983 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,232.50 [#/sec] (mean)
Time per request:		12.147 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,069.83 [Kbytes/sec] received
				16,069.83 kb/s sent
				32,139.67 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.461378 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,724.95 [#/sec] (mean)
Time per request:		11.461 [ms] (mean)
Time per request:		0.115 [ms] (mean, across all concurrent requests)
Transfer rate:			17,031.11 [Kbytes/sec] received
				17,031.11 kb/s sent
				34,062.22 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.247014 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,548.87 [#/sec] (mean)
Time per request:		13.247 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,735.40 [Kbytes/sec] received
				14,735.40 kb/s sent
				29,470.79 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.470986 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,423.36 [#/sec] (mean)
Time per request:		13.471 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,490.40 [Kbytes/sec] received
				14,490.40 kb/s sent
				28,980.80 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.838002 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,447.37 [#/sec] (mean)
Time per request:		11.838 [ms] (mean)
Time per request:		0.118 [ms] (mean, across all concurrent requests)
Transfer rate:			16,489.27 [Kbytes/sec] received
				16,489.27 kb/s sent
				32,978.54 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.253722 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,545.05 [#/sec] (mean)
Time per request:		13.254 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,727.94 [Kbytes/sec] received
				14,727.94 kb/s sent
				29,455.88 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.006369 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,688.54 [#/sec] (mean)
Time per request:		13.006 [ms] (mean)
Time per request:		0.130 [ms] (mean, across all concurrent requests)
Transfer rate:			15,008.03 [Kbytes/sec] received
				15,008.03 kb/s sent
				30,016.06 kb/s total
Warmup Completed!
===== CBR Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.211042 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,036.78 [#/sec] (mean)
Time per request:		14.211 [ms] (mean)
Time per request:		0.142 [ms] (mean, across all concurrent requests)
Transfer rate:			13,735.80 [Kbytes/sec] received
				13,735.80 kb/s sent
				27,471.60 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.798803 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99997
Total transferred:		390400000 bytes
Requests per second:		7,247.01 [#/sec] (mean)
Time per request:		13.799 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,146.15 [Kbytes/sec] received
				14,146.15 kb/s sent
				28,292.31 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.760157 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99882
Total transferred:		390400000 bytes
Requests per second:		7,267.36 [#/sec] (mean)
Time per request:		13.760 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,185.88 [Kbytes/sec] received
				14,185.88 kb/s sent
				28,371.77 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.539367 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99996
Total transferred:		390400000 bytes
Requests per second:		7,385.87 [#/sec] (mean)
Time per request:		13.539 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,417.22 [Kbytes/sec] received
				14,417.22 kb/s sent
				28,834.43 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.045919 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,119.51 [#/sec] (mean)
Time per request:		14.046 [ms] (mean)
Time per request:		0.140 [ms] (mean, across all concurrent requests)
Transfer rate:			13,897.27 [Kbytes/sec] received
				13,897.27 kb/s sent
				27,794.55 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.686400 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,306.52 [#/sec] (mean)
Time per request:		13.686 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			14,262.33 [Kbytes/sec] received
				14,262.33 kb/s sent
				28,524.67 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.812529 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,465.59 [#/sec] (mean)
Time per request:		11.813 [ms] (mean)
Time per request:		0.118 [ms] (mean, across all concurrent requests)
Transfer rate:			16,524.83 [Kbytes/sec] received
				16,524.83 kb/s sent
				33,049.65 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.676415 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,311.86 [#/sec] (mean)
Time per request:		13.676 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			14,272.75 [Kbytes/sec] received
				14,272.75 kb/s sent
				28,545.49 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.238814 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,553.55 [#/sec] (mean)
Time per request:		13.239 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,744.52 [Kbytes/sec] received
				14,744.52 kb/s sent
				29,489.05 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.848791 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,220.85 [#/sec] (mean)
Time per request:		13.849 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,095.09 [Kbytes/sec] received
				14,095.09 kb/s sent
				28,190.19 kb/s total
=== Completed ===
===== CBR Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		18.837895 seconds
Complete requests:		99995
Failed requests:		5
Write errors:			0
Kept alive:			99995
Total transferred:		390380480 bytes
Requests per second:		5,308.18 [#/sec] (mean)
Time per request:		18.839 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			10,361.56 [Kbytes/sec] received
				10,361.56 kb/s sent
				20,723.12 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.731147 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		7,282.64 [#/sec] (mean)
Time per request:		13.731 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			14,215.71 [Kbytes/sec] received
				14,215.71 kb/s sent
				28,431.42 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.442831 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99997
Total transferred:		390388288 bytes
Requests per second:		7,438.69 [#/sec] (mean)
Time per request:		13.443 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,520.30 [Kbytes/sec] received
				14,520.30 kb/s sent
				29,040.61 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.480619 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		7,417.98 [#/sec] (mean)
Time per request:		13.481 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,479.90 [Kbytes/sec] received
				14,479.90 kb/s sent
				28,959.80 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.303130 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		8,127.93 [#/sec] (mean)
Time per request:		12.303 [ms] (mean)
Time per request:		0.123 [ms] (mean, across all concurrent requests)
Transfer rate:			15,865.72 [Kbytes/sec] received
				15,865.72 kb/s sent
				31,731.44 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.596907 seconds
Complete requests:		99994
Failed requests:		6
Write errors:			0
Kept alive:			99994
Total transferred:		390376576 bytes
Requests per second:		6,850.36 [#/sec] (mean)
Time per request:		14.598 [ms] (mean)
Time per request:		0.146 [ms] (mean, across all concurrent requests)
Transfer rate:			13,371.87 [Kbytes/sec] received
				13,371.87 kb/s sent
				26,743.75 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.465423 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99997
Total transferred:		390388288 bytes
Requests per second:		8,021.95 [#/sec] (mean)
Time per request:		12.466 [ms] (mean)
Time per request:		0.125 [ms] (mean, across all concurrent requests)
Transfer rate:			15,658.84 [Kbytes/sec] received
				15,658.84 kb/s sent
				31,317.67 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.585758 seconds
Complete requests:		99998
Failed requests:		2
Write errors:			0
Kept alive:			99998
Total transferred:		390392192 bytes
Requests per second:		7,945.33 [#/sec] (mean)
Time per request:		12.586 [ms] (mean)
Time per request:		0.126 [ms] (mean, across all concurrent requests)
Transfer rate:			15,509.28 [Kbytes/sec] received
				15,509.28 kb/s sent
				31,018.55 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.109495 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,257.98 [#/sec] (mean)
Time per request:		12.109 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,119.58 [Kbytes/sec] received
				16,119.58 kb/s sent
				32,239.16 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.958989 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99997
Total transferred:		390388288 bytes
Requests per second:		6,684.74 [#/sec] (mean)
Time per request:		14.959 [ms] (mean)
Time per request:		0.150 [ms] (mean, across all concurrent requests)
Transfer rate:			13,048.61 [Kbytes/sec] received
				13,048.61 kb/s sent
				26,097.22 kb/s total
=== Completed ===
===== Transform Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		14.062901 seconds
Complete requests:		99998
Failed requests:		2
Write errors:			0
Kept alive:			99998
Total transferred:		308693826 bytes
Requests per second:		7,110.77 [#/sec] (mean)
Time per request:		14.063 [ms] (mean)
Time per request:		0.141 [ms] (mean, across all concurrent requests)
Transfer rate:			8,070.67 [Kbytes/sec] received
				13,880.21 kb/s sent
				21,950.88 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		13.667919 seconds
Complete requests:		99998
Failed requests:		2
Write errors:			0
Kept alive:			99998
Total transferred:		308693826 bytes
Requests per second:		7,316.26 [#/sec] (mean)
Time per request:		13.668 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			8,303.90 [Kbytes/sec] received
				14,281.33 kb/s sent
				22,585.22 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		13.389229 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		7,468.69 [#/sec] (mean)
Time per request:		13.389 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			8,476.96 [Kbytes/sec] received
				14,578.88 kb/s sent
				23,055.85 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		14.463395 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		308696913 bytes
Requests per second:		6,913.94 [#/sec] (mean)
Time per request:		14.464 [ms] (mean)
Time per request:		0.145 [ms] (mean, across all concurrent requests)
Transfer rate:			7,847.26 [Kbytes/sec] received
				13,496.00 kb/s sent
				21,343.26 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		13.739975 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		308696913 bytes
Requests per second:		7,277.96 [#/sec] (mean)
Time per request:		13.740 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			8,260.42 [Kbytes/sec] received
				14,206.58 kb/s sent
				22,467.00 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		14.166454 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99997
Total transferred:		308690739 bytes
Requests per second:		7,058.72 [#/sec] (mean)
Time per request:		14.167 [ms] (mean)
Time per request:		0.142 [ms] (mean, across all concurrent requests)
Transfer rate:			8,011.60 [Kbytes/sec] received
				13,778.61 kb/s sent
				21,790.21 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		13.714048 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		7,291.79 [#/sec] (mean)
Time per request:		13.714 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			8,276.19 [Kbytes/sec] received
				14,233.58 kb/s sent
				22,509.77 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		14.813004 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99997
Total transferred:		308690739 bytes
Requests per second:		6,750.62 [#/sec] (mean)
Time per request:		14.813 [ms] (mean)
Time per request:		0.148 [ms] (mean, across all concurrent requests)
Transfer rate:			7,661.92 [Kbytes/sec] received
				13,177.21 kb/s sent
				20,839.12 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		14.751694 seconds
Complete requests:		99994
Failed requests:		6
Write errors:			0
Kept alive:			99994
Total transferred:		308681478 bytes
Requests per second:		6,778.48 [#/sec] (mean)
Time per request:		14.753 [ms] (mean)
Time per request:		0.148 [ms] (mean, across all concurrent requests)
Transfer rate:			7,693.56 [Kbytes/sec] received
				13,231.56 kb/s sent
				20,925.12 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		12.768417 seconds
Complete requests:		99998
Failed requests:		2
Write errors:			0
Kept alive:			99998
Total transferred:		308693826 bytes
Requests per second:		7,831.67 [#/sec] (mean)
Time per request:		12.769 [ms] (mean)
Time per request:		0.128 [ms] (mean, across all concurrent requests)
Transfer rate:			8,888.89 [Kbytes/sec] received
				15,287.41 kb/s sent
				24,176.29 kb/s total
=== Completed ===